# St7DisableLoadPathTemplateVehicleLane

Disables a vehicle/lane combination within the specified load path template.

long St7DisableLoadPathTemplateVehicleLane(long uID, long TemplateID,

long Vehicle, long Lane)

Input Parameters

uID

Strand7 model file ID.

TemplateID

Load path template ID.

Vehicle

Vehicle number.

Lane

Lane number.